<?php
/**
 * Created by PhpStorm.
 * User: cscjj2008
 * Date: 17/4/21
 * Time: 下午4:06
 */

namespace Admin\Controller;


/**
 * 用户存管账号查询
 * Class UserFundController
 * @package Admin\Controller
 */
class UserFundController extends AdminController
{


    private
        $params = [
        [
            'name'    => '交易相关',
            'methods' => [
                [
                    'sub_name'=>'订单状态查询',
                    'key'=>'trade/orderinfo',
                    'fields'=>[
                        [
                            'name'=>'query_order_no',
                            'remark' => '查询的订单号'
                        ]
                    ]
                ]
            ]
        ],
        [
            'name'=>'标的相关',
            'methods' => [
                [
                    'sub_name'=>'标的信息查询',
                    'key'=>'project/info',
                    'fields'=>[
                        [
                            'name'=>'prod_id',
                            'remark' => '标的id'
                        ]
                    ]
                ],
                [
                    'sub_name'=>'标的投资明细查询',
                    'key'=>'project/buyinfo',
                    'fields'=>[
                        [
                            'name'=>'prod_id',
                            'remark' => '标的id'
                        ],
                        [
                            'name'=>'pagesize',
                            'remark' => '分页大小'
                        ],
                        [
                            'name'=>'pagenum',
                            'remark' => '页码'
                        ]
                    ]
                ],
                [
                    'sub_name'=>'标的还款明细查询',
                    'key'=>'project/refund',
                    'fields'=>[
                        [
                            'name'=>'prod_id',
                            'remark' => '标的id'
                        ],
                        [
                            'name'=>'platcust',
                            'remark' => '客户编号'
                        ],
                        [
                            'name'=>'type',
                            'remark' => '1-	查询投资人收款记录；2-	查询借款人还款记录'
                        ],
                        [
                            'name'=>'start_date',
                            'remark' => '查询起始时间'
                        ],
                        [
                            'name'=>'end_date',
                            'remark' => '查询结束时间'
                        ]
                    ]
                ],
                [
                    'sub_name'=>'标的账户余额查询',
                    'key'=>'project/balace',
                    'fields'=>[
                        [
                            'name'=>'prod_id',
                            'remark' => '标的id'
                        ],
                        [
                            'name'=>'type',
                            'remark' => '资金类型 现金01   在途02'
                        ]
                    ]
                ],
            ]
        ],
        [
            'name'=>'用户相关',
            'methods' => [
                [
                    'sub_name'=>'平台客户编号查询',
                    'key'=>'account/platcust',
                    'fields'=>[
                        [
                            'name'=>'id_code',
                            'remark' => '身份证'
                        ],
                    ]
                ],
                [
                    'sub_name'=>'资金余额查询',
                    'key'=>'account/info',
                    'fields'=>[
                        [
                            'name'=>'account',
                            'remark' => '客户编号'
                        ],
                    ]
                ],
                [
                    'sub_name'=>'账户余额明细查询',
                    'key'=>'account/balace',
                    'fields'=>[
                        [
                            'name'=>'account',
                            'remark' => '客户编号'
                        ],
                        [
                            'name'=>'acct_type',
                            'remark' => '账号类型'
                        ],
                        [
                            'name'=>'fund_type',
                            'remark' => '资金类型'
                        ],
                    ]
                ],
                [
                    'sub_name'=>'资金变动明细查询',
                    'key'=>'account/fundlist',
                    'fields'=>[
                        [
                            'name'=>'platcust',
                            'remark' => '客户编号'
                        ],
                        [
                            'name'=>'acct_type',
                            'remark' => '5-低佣金 6-加息活动金9-奖励金11-在途垫付'
                        ],
                        [
                            'name'=>'pagesize',
                            'remark' => '分页大小'
                        ],
                        [
                            'name'=>'pagenum',
                            'remark' => '页码'
                        ],
                    ]
                ],
                [
                    'sub_name'=>'客户信息变更',
                    'key'=>'account/accountupdate',
                    'fields'=>[
                        [
                            'name'=>'platcust',
                            'remark' => '客户编号'
                        ],
                        [
                            'name'=>'cus_type',
                            'remark' => '客户类型（1:个人客户，2:企业客户，不传参数则默认为”个人客户“）'
                        ],
                        [
                            'name'=>'email',
                            'remark' => '电子邮箱'
                        ],
                        [
                            'name'=>'mobile',
                            'remark' => '手机号'
                        ],
                        [
                            'name'=>'org_name',
                            'remark' => '企业名称（企业客户必填）'
                        ],
                        [
                            'name'=>'business_license',
                            'remark' => '营业执照编号（企业客户，营业执照编号、社会信用代码证要二选一）'
                        ],
                        [
                            'name'=>'bank_license',
                            'remark' => '社会信用代码证（企业客户，营业执照编号、社会信用代码证要二选一）'
                        ],
                    ]
                ],
            ],
        ],
        [
            'name'    => '企业银行卡相关',
            'methods' => [
                [
                    'sub_name'=>'银行卡解绑',
                    'key'=>'account/unbingbankcard',
                    'fields'=>[
                        [
                            'name'=>'platcust',
                            'remark' => '客户编号'
                        ],
                        [
                            'name'=>'mobile',
                            'remark' => '预留手机号'
                        ],
                        [
                            'name'=>'card_no_old',
                            'remark' => '原卡号'
                        ],
                        [
                            'name'=>'name',
                            'remark' => '姓名'
                        ],
                    ]
                ],
                [
                    'sub_name'=>'银行卡绑定',
                    'key'=>'account/bingbankcard',
                    'fields'=>[
                        [
                            'name'=>'platcust',
                            'remark' => '客户编号'
                        ],
                        [
                            'name'=>'type',
                            'remark' => '绑卡类型：1个人客户 2 对公客户'
                        ],
                        [
                            'name'=>'id_type',
                            'remark' => '证件类型（1：身份证）,个人客户必填'
                        ],
                        [
                            'name'=>'id_code',
                            'remark' => '证件号码,个人客户必填'
                        ],
                        [
                            'name'=>'name',
                            'remark' => '姓名,个人客户必填'
                        ],
                        [
                            'name'=>'card_no',
                            'remark' => '卡号，个人客户必填'
                        ],
                        [
                            'name'=>'card_type',
                            'remark' => '卡类型(1:借记卡，2:信用卡)'
                        ],
                        [
                            'name'=>'pre_mobile',
                            'remark' => '预留手机号(个人客户必填)'
                        ],
                        [
                            'name'=>'org_no',
                            'remark' => '组织机构代码，对公客户必填'
                        ],
                        [
                            'name'=>'acct_name',
                            'remark' => '账户名称，对公客户必填'
                        ],
                        [
                            'name'=>'acct_no',
                            'remark' => '账号，对公客户必填'
                        ],
                        [
                            'name'=>'open_branch',
                            'remark' => '开户银行，对公客户必填'
                        ],
                    ]
                ],
            ]
        ],
        [
            'name'    => '转账',
            'methods' => [
                [
                    'sub_name'=>'现金券转账个人',
                    'key'=>'trade/plattrans',
                    'fields'=>[
                        [
                            'name'=>'platcust',
                            'remark' => '客户编号'
                        ],
                        [
                            'name'=>'amount',
                            'remark' => '转账金额'
                        ],
                        [
                            'name'=>'acct_type',
                            'remark' => '1-平台自有账户 3-手续费账户 4-体验金 5-低佣金 6-加息活动金 7-保证金 9-奖励金 10-现金垫付'
                        ],
                        [
                            'name'=>'cause_type',
                            'remark' => '1 平台赠送2 平台补贴3 活动派发4 抵扣券未使用派发5 迁移存管转账6 加息补偿'
                        ],
                        [
                            'name'=>'charge_type',
                            'remark' => '1投资账户2融资账户'
                        ],
                    ]
                ]
            ]
        ],
    ];
    /**
     *
     */
    public function index(){
        $params = $this->params;
        $this->assign('params', $params);
        $this->display();
    }

    public function select_search(){
        $name = I('get.type');
        foreach($this->params as $key => $val){
            if($val['name'] == $name){
                $this->assign('methods', $val);
            }
        }
        $this->display();
    }

    public function select_params(){
        $name = I('get.methods');
        foreach($this->params as $key => $val){
            foreach($val['methods'] as $k => $v){
                if($v['sub_name'] == $name){
//                    var_dump($v);
                    $this->assign('method', $v);
                }
            }

        }
        $this->display();
    }

    public function request(){

        $key = I('post.key');
        unset($_POST['key']);
        $update_login_mobile = I('post.update_login_mobile',0);
        unset($_POST['update_login_mobile']);



        vendor('Fund.FD');
        vendor('Fund.sign');
        $fd  = new \FD();
        foreach($_POST as $k => $val){
            if($val == ''){
                unset($_POST[$k]);
            }else{
                $_POST[$k] = trim($val);
            }

        }
        $plainText =  \SignUtil::params2PlainText($_POST);
        $sign =  \SignUtil::sign($plainText);
        $_POST['signdata'] = $sign;

        $json  = $fd->post($key,$_POST);


        $data = json_decode($json);
        if($data->code == 0){
            if($key == "account/accountupdate" && $_POST['cus_type'] != 2){
                $user = M('User')->where(['platcust' => trim(I('post.platcust'))])->find();

                M('User')->startTrans();

                $row = [
                    'mobile'=>trim(I('post.mobile')),
                ];
                $updateBank = M('UserBank')->where(['user_id'=>$user['id'],'main_card'=>1])->save($row);

                if($update_login_mobile == 1){
                    $user_row = [
                        'mobile'=>trim(I('post.mobile')),
                        'username'=>trim(I('post.mobile')),
                    ];
                }else{
                    $user_row = [
                        'mobile'=>trim(I('post.mobile')),
                    ];
                }
                $updateUser = M('User')->where(['id'=>$user['id']])->save($user_row);

                if($updateBank){
                    M('User')->commit();
                }else{
                    M('User')->rollback();
                }

            }
        }


        header('Content-Type:application/json; charset=utf-8');
        echo $json;
    }
    public function all_projects(){


        ini_set("memory_limit", "1000M");

        ini_set("max_execution_time", 0);
        $sql = "SELECT id,fid,'','','15%','','',2,real_amount FROM
(
SELECT DISTINCT(project_id),SUM(due_capital) AS real_amount  FROM ppmiao_online.`s_user_due_detail` WHERE project_id IN (
SELECT project_id FROM ppmiao_online.`s_repayment_detail` WHERE repayment_time>'2017-08-18'
) AND user_id>0 GROUP BY project_id) b,ppmiao_online.s_project a WHERE a.id=b.project_id and a.id = 2495 limit 100";
        $projects = M()->query($sql);
        $error = [];
        foreach($projects as $key =>$val){
            $re_error = $this->check($val['id']);
            if(!empty($re_error)){
                $error[$val['id']] = $re_error;
            }else{
                $error[$val['id']] = true;
            }
        }
        var_dump($error);

    }

    public function check(){
        $pid  = $_GET['pid'];
        $error_data = [];
        $cg_data = $this->get_cg_detail($pid);
        $local_data = $this->get_detail($pid);
        $cg_check_data = [];

        foreach($cg_data as $key => $val){
            if(isset($cg_check_data[$val->platcust])){
                $cg_check_data[$val->platcust] = $cg_check_data[$val->platcust] + $val->vol;
            }else{
                $cg_check_data[$val->platcust] = $val->vol;
            }

        }
//        foreach($cg_check_data as $k => $v){
//            if($v != $local_data[$k]){
//                $error_data[] = ['pid'=>$pid,'plat_cust'=>$k];
//            }
//        }

//            var_dump($local_data);
        $body = '<table  border="1"><tr><td>标ID</td><td>用户客户编号</td><td>数据库现有值</td><td>存管查询值</td></tr>';
        foreach($local_data as $k => $v){
            if($v != $cg_check_data[$k]){
//                var_dump($k);
//                var_dump($local_data[$k]);
//                var_dump($cg_check_data[$k]);
                $error_data[] = ['pid'=>$pid,'plat_cust'=>$k];



                $body .='<tr><td>'.$pid.'</td><td>'.$k.'</td><td>'.$v.'</td><td>'.$cg_check_data[$k].'</td></tr>';

            }
        }

        $body .= '</table>';
//        return $error_data;
        if($error_data){
            $this->sendEmail($body);
        }
    }

    public function get_cg_detail($pid){
        vendor('Fund.FD');
        vendor('Fund.sign');
        $fd  = new \FD();
        $postData['prod_id'] = $pid;
        $postData['pagesize'] = 200;
        $plainText =  \SignUtil::params2PlainText($postData);
        $sign =  \SignUtil::sign($plainText);
        $postData['signdata'] = $sign;

        $json  = $fd->post("project/buyinfo",$postData);
        $data = json_decode($json);
        return $data->result;
    }

    public function get_detail($pid){
        $sql = "select u.platcust,d.due_capital from s_user_due_detail as d left join s_user as u on u.id = d.user_id where d.`project_id` = $pid and d.user_id > 0 ";
        $datas = M()->query($sql);
        $local_check_data = [];
        foreach($datas as $key => $val){
            if(isset($local_check_data[$val['platcust']])){
                $local_check_data[$val['platcust']] = $local_check_data[$val['platcust']] + $val['due_capital'];
            }else{
                $local_check_data[$val['platcust']] = $val['due_capital'];
            }
        }
        return $local_check_data;
    }


    public function ids(){
        $content = "
6222620170001584361	342626198907016143	廉美慧	18258480476	交通银行	2017-08-17 21:41:14.000000
6215582312001946394	513001199610081638	符星	13036632334	工商银行	2017-08-17 19:39:33.000000
6217856000067034909	37068619861124557X	林春雨	13884667608	中国银行	2017-08-17 17:20:48.000000
6228480759313689979	420624196904260104	李国红	13135870566	农业银行	2017-08-17 13:34:49.000000
6222083002002683431	650103197912125111	张晓祥	13899837613	工商银行	2017-08-17 10:29:46.000000
6228480399622800478	32012119880817001X	汲昇龙	13813088286	农业银行	2017-08-17 10:08:26.000000
6217681400472141	120106198701070536	曹庆伟	13820857791	中信银行	2017-08-16 20:47:49.000000
6212261202013716114	330103198702090010	陈璠磊	13173609822	工商银行	2017-08-16 19:24:05.000000
6230580000027203707	120223198105174429	王莉莉	13662049603	平安银行	2017-08-15 22:44:57.000000
6228481068824721670	370181198706020710	李坤	13082867170	农业银行	2017-08-15 17:56:22.000000
6212261402025660231	350181199208052411	林超	15060409976	工商银行	2017-08-15 14:54:43.000000
6232111830000768118	350521198903032528	郭小红	18659070960	建设银行	2017-08-15 12:23:04.000000
6228480560184314915	210203198107165514	高鹏	13664230520	农业银行	2017-08-15 08:34:13.000000
6217000940012017456	220319197104081861	张丽萍	18946669759	建设银行	2017-08-14 21:12:34.000000
6228480399842641470	410223199001027567	郑丽委	13613882095	农业银行	2017-08-13 14:43:40.000000
6217002980106491827	432824196305240747	王德环	13270654161	建设银行	2017-08-12 12:17:33.000000
6228270541257182276	220203197103100040	李英	15568271789	农业银行	2017-08-12 09:15:26.000000
6228480427980092675	320626196308025289	施锦超	13912884035	农业银行	2017-08-11 11:03:37.000000
6212260715000334485	211122197804291911	陈峰	13050977722	工商银行	2017-08-09 21:24:17.000000
6222620640011309082	430124198105230033	谢靖	13975123343	交通银行	2017-08-09 18:49:38.000000
6228481042356882911	321102198202191926	王婷	18112105219	农业银行	2017-08-09 15:20:07.000000
622909357695010717	330103195805181018	孙文祥	13083996993	兴业银行	2017-08-09 11:27:04.000000
6230520910002427373	140202197504241518	王宏	13994305459	农业银行	2017-08-08 21:19:00.000000
6222023700002539577	610104197802212686	岳小婷	15829097357	工商银行	2017-08-08 14:52:43.000000
6228481590416125218	230226197412242727	闫辉	13206809218	农业银行	2017-08-08 14:18:59.000000
6210812831006294727	371581198704044455	侯国才	18033556355	建设银行	2017-08-08 06:44:41.000000
6228480106304238574	445321199006203120	冯志杏	18318555910	农业银行	2017-08-07 21:04:13.000000
6212260512000421705	142202198906180216	张岩	13663503428	工商银行	2017-08-05 14:56:39.000000
6217001540017225861	330225198808250354	郑志成	15858268501	建设银行	2017-08-02 21:00:10.000000
6217002250000645435	371202198910030837	李秉涛	15020863717	建设银行	2017-08-02 16:53:22.000000
6236681450003335988	330625194810031613	阮茂林	13106372268	建设银行	2017-07-31 17:43:08.000000
6212881605000065222	370402198902097820	张蕊	15266262582	工商银行	2017-07-30 15:15:19.000000
6217004360001204435	620202197711160416	李万忠	18993799136	建设银行	2017-07-28 11:08:16.000000
6217561400017798494	330222196003084469	徐仁英	18958342120	中国银行	2017-07-27 23:50:00.000000
6212264402058499819	510112197206141021	胡友华	18708171339	工商银行	2017-07-27 19:31:43.000000
6217993720011170228	341226199101164456	徐标	15556872328	邮政储蓄	2017-07-27 19:26:01.000000
6215581803002227389	420222195211018316	吴耀华	18971626593	工商银行	2017-07-27 17:25:09.000000
6225212582731789	142429197903052821	赵海花	13834524746	浦发银行	2017-07-27 10:54:41.000000
6222023006001638075	654222197410090519	肖刚	13709938011	工商银行	2017-07-26 17:29:15.000000
6225885106528995	320321199008173023	王艳婷	15251507839	招商银行	2017-07-26 13:54:03.000000
6217992610016327975	230105197505182324	李燕	15004687595	邮政储蓄	2017-07-26 08:25:30.000000
6225800210535471	310103196706022418	杨克坚	13818084284	招商银行	2017-07-25 15:32:28.000000
6217001210024089094	420921198908032850	罗招招	13774296117	建设银行	2017-07-25 14:20:20.000000
6217001370004630489	320102198604130025	周婧炜	13851770910	建设银行	2017-07-25 09:28:23.000000
6217001370020552675	320102199302213217	徐渊之	13813800816	建设银行	2017-07-25 07:34:06.000000
6217996900030930565	512928196610274418	张昌明	13064256655	邮政储蓄	2017-07-24 16:45:57.000000
6222620620003425260	612401199012121577	曾鹏	18574135958	交通银行	2017-07-24 10:33:42.000000
6228480415791087273	321283199706047416	戴鹏	15380733396	农业银行	2017-07-23 21:27:30.000000
6228482399299113674	41302819681004464X	丁秀芳	17159981929	农业银行	2017-07-22 23:06:05.000000
6215591905001806283	430422199702208510	何强	17352623201	工商银行	2017-07-22 13:20:45.000000
6217002270007142012	371424198605013618	菅纪砚	13953174095	建设银行	2017-07-21 14:33:46.000000
6227000650750040714	211004196612241511	刘大伟	13125682810	建设银行	2017-07-20 19:34:17.000000
6228480858813537876	452227196306085013	韦家田	13768850161	农业银行	2017-07-20 07:05:07.000000
6228480188438041371	232622197505070133	孟广东	18745756901	农业银行	2017-07-19 20:52:00.000000
6228480898550878174	622301197212140315	赵爱军	15160887271	农业银行	2017-07-19 16:36:47.000000
6222023301042263029	21010619720309062X	李珍钰	15640433292	工商银行	2017-07-18 22:46:01.000000
6212260200051503858	110106196211092782	李凤霞	15510778163	工商银行	2017-07-18 12:09:03.000000
6217866300003178093	34128119581113061X	刘新安	17330758928	中国银行	2017-07-18 11:03:23.000000
4340623320983331	450331198510283014	李金光	17776086620	建设银行	2017-07-18 00:33:15.000000
622908493826058712	340204199402090324	胡聪	18365172796	兴业银行	2017-07-15 11:03:09.000000
6214854514185965	230521199002211163	宋宇	13968419621	招商银行	2017-07-14 17:57:21.000000
6217856000057203720	230183198411281245	滕海清	15689984178	中国银行	2017-07-12 21:53:13.000000
6217001210037224118	420822198911174578	许辉	13917450514	建设银行	2017-07-12 16:15:17.000000
6212262303000748885	510311197009101922	张庚容	18008150320	工商银行	2017-07-08 12:50:40.000000
6222081202007685249	330324198301062097	姚必策	13867121452	工商银行	2017-07-07 21:27:30.000000
6230580000057108743	36250219831206563X	邓志辉	13249875859	平安银行	2017-07-07 12:20:44.000000
6228480538224869379	220111197107060829	刘金颖	15948345766	农业银行	2017-07-06 19:41:45.000000
6217230906000385637	230402194906150140	张丽华	13089770098	工商银行	2017-07-06 17:23:00.000000
4340610780282239	210203195609011028	李世娜	13942058123	建设银行	2017-07-06 17:21:10.000000
6217004220014451672	610122197109100021	吴凤云	15692074551	建设银行	2017-07-06 10:39:24.000000
6217920181191870	430121198912222815	唐伟杰	17621216493	浦发银行	2017-07-05 22:29:10.000000
6217000010023167482	220621199007230519	姜祈龙	15701531980	建设银行	2017-07-05 21:48:15.000000
622908333010306438	431122199904165816	杨奕	17665207917	兴业银行	2017-07-05 10:52:35.000000
6217856100027334181	320121199205302727	陈婷婷	18013811590	中国银行	2017-07-04 21:14:38.000000
6217000130031664773	130229199705080092	胡泽林	15226529760	建设银行	2017-07-03 22:36:18.000000
6217001690000445321	340721196609092722	王丽珍	13093733779	建设银行	2017-07-03 20:36:56.000000
6213360530030065414	220102198112114818	甘俊生	13944071193	农业银行	2017-07-02 12:19:18.000000
6222020408009873402	130981196708062447	王如霞	15720223963	工商银行	2017-07-01 17:07:49.000000
6222021717000302537	412701197211091606	张树琛	13033911987	工商银行	2017-06-29 17:22:17.000000
6222020904004931377	23080219880609011X	于雷	13089633329	工商银行	2017-06-29 10:34:29.000000
6226982100074206	320204196311252028	顾小燕	13003303239	中信银行	2017-06-28 12:47:57.000000
6217002450004861091	410328199612015028	刘美琪	18437958099	建设银行	2017-06-28 12:30:14.000000
622908446582889910	120107199205120611	张鑫洋	13163037917	兴业银行	2017-06-27 14:02:20.000000
6228480328152605171	413026199502181838	江培耀	13123927042	农业银行	2017-06-25 17:43:22.000000
622908391530964714	452523197603251714	蔡光福	13711831228	兴业银行	2017-06-24 22:46:21.000000
6222021615014727261	370522199011032017	陈春城	15166280887	工商银行	2017-06-24 20:51:28.000000
6228480453473065317	320324198808250044	陈秀秀	18136038665	农业银行	2017-06-24 17:29:41.000000
6222020302035714849	120106199203050545	邵云	13672111828	工商银行	2017-06-24 15:59:39.000000
6217002250003037408	371202198010254712	吕德圣	18506345234	建设银行	2017-06-23 21:21:43.000000
6217002250003274803	370811198810242048	郭广香	13806349570	建设银行	2017-06-23 21:17:45.000000
6226090102364979	370681198507302229	牛宝蕾	13810586475	招商银行	2017-06-23 17:17:48.000000
6222600140011286236	340323198511111323	刘姗姗	13862550633	交通银行	2017-06-23 09:02:59.000000
6215590607001771134	152101198011303027	陈绪莲	15049537218	工商银行	2017-06-22 13:18:02.000000
6222021608016499054	370882198908292436	栾绪龙	18660724351	工商银行	2017-06-21 16:33:08.000000
6216617001002901584	440507198902112213	纪泽锋	18823118989	中国银行	2017-06-20 19:25:59.000000
6212264000055988063	421181198004216212	陈重兵	15118064588	工商银行	2017-06-18 17:02:00.000000
6214857211025533	360311199201260545	夏伟兰	17673111585	招商银行	2017-06-17 23:35:30.000000
6236683320004996369	450512199112151039	利广超	15692028009	建设银行	2017-06-17 22:23:06.000000
6217855000037572252	132826196103273323	冯泽侠	13383679956	中国银行	2017-06-17 05:18:03.000000
6212264000026269130	430623199010120726	杨丽	13728927450	工商银行	2017-06-16 20:48:40.000000
6227002008920583394	320323199112177019	程锋	18795954779	建设银行	2017-06-16 17:46:11.000000
6222021202019665893	320524197202270573	吴华	13757190721	工商银行	2017-06-15 17:22:22.000000
6228480433591225019	320222197608132462	王海芳	13921283588	农业银行	2017-06-15 13:44:59.000000
6228480038169907276	520181198607271328	杨伯静	13162883152	农业银行	2017-06-15 10:32:23.000000
4682037556241999	510202195911050647	师伟	13534025240	招商银行	2017-06-14 23:47:46.000000
6228480703096611818	350621197511251028	徐淑玲	13459628069	农业银行	2017-06-12 18:54:13.000000
6225211480394815	41040219870215554X	娄岁寒	18236929887	浦发银行	2017-06-11 19:02:51.000000
6217568400028278943	210922196610070027	董桂琴	15164922591	中国银行	2017-06-11 18:17:07.000000
6217985200008280124	422400194609198011	梁敦春	13477394842	邮政储蓄	2017-06-10 15:53:10.000000
6217856000014724826	37132319900225372X	崔莹	13606459227	中国银行	2017-06-08 15:25:26.000000
6210810590000715515	210404198304031221	崔世阳	15642032456	建设银行	2017-06-06 00:07:32.000000
6212261202019516849	342622198909017304	钱峰	15381176896	工商银行	2017-06-01 15:33:45.000000
6212260200041933413	612727197710170086	高洁	13810954650	工商银行	2017-05-31 15:11:30.000000
6222030200000189930	413026199005147225	任巧	15801271165	工商银行	2017-05-28 08:40:29.000000
6222022318003419359	510802196801100022	冯碧蓉	18398931512	工商银行	2017-05-21 14:33:08.000000
6214623521000670391	52222519910101283X	彭飞	18752007701	广发银行	2017-05-16 21:59:54.000000
6212261901001859253	430481198705115040	谷梅	15116186484	工商银行	2017-05-15 17:22:52.000000
6013826106005238898	320925199305202028	费元元	18260623267	中国银行	2017-05-14 08:24:44.000000
6217865000006507295	230281199503310944	张雪	17079020302	中国银行	2017-05-13 16:42:20.000000
6222021103018359837	320211198201052212	尤中华	13771111765	工商银行	2017-05-12 10:53:33.000000
622909211536185115	429001198806088056	张从平	18531621489	兴业银行	2017-05-11 12:24:39.000000
6228270621229192676	440882199106230519	杨泉欢	13724789754	农业银行	2017-05-07 23:57:26.000000
6217587600003439108	420602199205160038	贺江森	15571186863	中国银行	2017-05-06 14:17:45.000000
6212261001023250803	350301198409232851	郑仙林	18965887235	工商银行	2017-05-05 14:28:25.000000
6236681790001031190	341227198806091017	任鑫龙	18712206825	建设银行	2017-05-05 14:09:25.000000
6228481200292079915	640204195405100033	刘玉良	13099561941	农业银行	2017-05-04 20:47:01.000000
6217004470021821280	640204195503271020	秦春环	13099560243	建设银行	2017-05-04 20:44:03.000000
6214830251586417	321324199105040097	马振宇	18651090153	招商银行	2017-05-04 09:23:12.000000
6214850240030244	210104198210050919	陈崭峰	13897996116	招商银行	2017-04-26 09:38:16.000000
6222082201001488765	460021194709150627	张惠容	13637649148	工商银行	2017-04-25 20:10:08.000000
6225683421003243424	330702198203150038	潘磊	15325927887	广发银行	2017-04-25 14:43:50.000000
622909397141914716	440601194505101528	罗惠清	13620114996	兴业银行	2017-04-24 13:49:05.000000
6236680180001519082	130281198202092324	张洪英	15512539365	建设银行	2017-04-21 12:55:58.000000
622468001010823494	310104195803252831	杨永浩	13918580708	上海银行	2017-04-18 20:47:03.000000
6217001070009017779	230621197604023019	于洪君	18645935178	建设银行	2017-04-18 14:40:26.000000
6227001143470115106	230802199107181324	周莹	18745707025	建设银行	2017-04-13 12:45:15.000000
622908576444424611	130503197510160053	刘利斌	13730399562	兴业银行	2017-04-10 15:35:58.000000
6214837841719747	371525198505103714	安书博	14715038075	招商银行	2017-04-10 11:43:37.000000
6217002300000640231	37292319890114231x	崔荣振	15098384043	建设银行	2017-03-28 15:54:53.000000
6222980024312623	420703198708063771	陈伟峰	13077890624	平安银行	2017-03-26 20:12:33.000000
6226220115693912	432826199504013017	李兵兵	18801402495	民生银行	2017-03-15 20:29:36.000000
6210811592010638793	330781199606184312	吴杰星	15258933475	建设银行	2017-01-02 19:16:15.000000
6216910104915100	110221198112091985	郑丽丽	13810596582	民生银行	2016-11-11 20:46:00.000000
6210982400022861804	222403198704093824	刁俊佳	18618291665	邮政储蓄	2016-11-02 11:33:46.000000
6216616108001204729	320705197212212512	李兴东	18036636971	中国银行	2016-10-25 17:19:00.000000
6228480969602539476	532123198910124136	肖贵江	15987153791	农业银行	2016-05-15 15:13:48.000000
";
        $ids = [];
        $arr = explode("\n",$content);
        $i = 1;
        $obj = M("UserBank");
        foreach($arr as $key => $val){
            $a = explode("	",$val);
            $ids[] = $a[0];
//            var_dump($a);
            $editData = [];
            $where = ['bank_card_no'=>$a[0],"id_no"=>$a[1],"acct_name"=>$a[2],"bank_name"=>$a[4],"latest_payment_time"=>$a[5]];
            $oc = $obj->where($where)->find();
            $ocb = M("UserBankCopyBak")->where($where)->find();
            $user = M("User")->where(['id'=>$oc['user_id']])->find();


            echo $oc['bank_card_no']."	".$oc['id_no']."	".$oc['acct_name']."	".$oc['mobile']."	".$ocb['mobile']."	".$user['platcust']."<br>";
        }
        echo $i;
//        echo implode(',',$ids);

    }

    function  newids(){
        $content = "6222620620003425260	612401199012121577	曾鹏	15238361202
6228480415791087273	321283199706047416	戴鹏	13052999018
6228482399299113674	41302819681004464X	丁秀芳	18665373489
6215591905001806283	430422199702208510	何强	15273494277
6217002270007142012	371424198605013618	菅纪砚	13199440837
6227000650750040714	211004196612241511	刘大伟	13624190698
6228480858813537876	452227196306085013	韦家田	13737202267
6228480188438041371	232622197505070133	孟广东	18745756903
6228480898550878174	622301197212140315	赵爱军	15719987172
6212260200051503858	110106196211092782	李凤霞	13121691468
6217866300003178093	34128119581113061X	刘新安	13605683789
4340623320983331	450331198510283014	李金光	18276369266
622908493826058712	340204199402090324	胡聪	13195339811
6214854514185965	230521199002211163	宋宇	18651415626
6217856000057203720	230183198411281245	滕海清	18669830895
6217001210037224118	420822198911174578	许辉	17612161428
6212262303000748885	510311197009101922	张庚容	13990045650
6222081202007685249	330324198301062097	姚必策	13396719682
6230580000057108743	36250219831206563X	邓志辉	15889772093
6228480538224869379	220111197107060829	刘金颖	18686617175
6217230906000385637	230402194906150140	张丽华	15636720927
4340610780282239	210203195609011028	李世娜	13654910109
6217004220014451672	610122197109100021	吴凤云	18329966717
6217920181191870	430121198912222815	唐伟杰	18121086389
6217000010023167482	220621199007230519	姜祈龙	18910188312
622908333010306438	431122199904165816	杨奕	18126400630
6217856100027334181	320121199205302727	陈婷婷	18952012820
6217001690000445321	340721196609092722	王丽珍	13866848856
6213360530030065414	220102198112114818	甘俊生	13756652374
6222020408009873402	130981196708062447	王如霞	15931733729
6216910104915100	110221198112091985	郑丽丽	18618291665";
        $ids = [];
        $arr = explode("\n",$content);
        $i = 1;
        $obj = M("UserBank");
        foreach($arr as $key => $val){
            $a = explode("	",$val);
            $ids[] = $a[0];
//            var_dump($a);
            $editData = [];
            $where = ['bank_card_no'=>$a[0],"id_no"=>$a[1],"acct_name"=>$a[2]];
            $oc = $obj->where($where)->find();
            $ocb = M("UserBankCopyBak")->where($where)->find();
            $user = M("User")->where(['id'=>$oc['user_id']])->find();


            echo $oc['bank_card_no']."	".$oc['id_no']."	".$oc['acct_name']."	".$oc['mobile']."	".$ocb['mobile']."	".$user['platcust']."<br>";
        }
        echo $i;
//        echo implode(',',$ids);
    }

    function forX(){
        $users = M("User")->where("card_no like '%x%' and platcust_auth = 1")->select();


        foreach($users as $user){
//            echo $user['card_no']."<br>";
            $x = substr($user['card_no'], -1);
            if(!$this->checkCase($x)){
                echo $user['card_no']."<br>";
                $upper = strtoupper($user['card_no']);
                echo $upper."<br>";

                $save = [];
                $save['card_no'] = $upper;
                $res = M("User")->where(["id"=>$user['id']])->save($save);
                var_dump($res);

            }
        }

    }
    function checkCase($str){
        if(preg_match('/^[a-z]+$/', $str)){
            return 0;
        }elseif(preg_match('/^[A-Z]+$/', $str)){
            return 1;
        }
    }
    public function sendEmail($body){
        vendor('PHPMailer.PHPMailerAutoload');

        $mail = new \PHPMailer;

        $mail->isSMTP();                                      // Set mailer to use SMTP
        $mail->Host = 'smtp.exmail.qq.com';  // Specify main and backup SMTP servers
        $mail->SMTPAuth = true;                               // Enable SMTP authentication
        $mail->Username = 'lintao@ppmiao.cn';                 // SMTP username
        $mail->Password = '123456Qwe';                           // SMTP password
        $mail->SMTPSecure = 'ssl';                            // Enable TLS encryption, `ssl` also accepted
        $mail->Port = 465;
        $mail->CharSet = "UTF-8";                       // TCP port to connect to

        $mail->setFrom('lintao@ppmiao.cn', 'Date Team');
        $mail->addAddress('chenyj@ppmiao.cn');               // Name is optional
        $mail->addAddress('tangxl@ppmiao.cn');               // Name is optional
        $mail->addAddress('xuhui@ppmiao.cn');               // Name is optional
        $mail->addAddress('lintao@ppmiao.cn');               // Name is optional
        $mail->addAddress('chenjunjie@ppmiao.cn');               // Name is optional
//        $mail->addReplyTo('info@example.com', 'Information');
//        $mail->addCC('cc@example.com');
//        $mail->addBCC('bcc@example.com');

//        $mail->addAttachment('/var/tmp/file.tar.gz');         // Add attachments
//        $mail->addAttachment('/tmp/image.jpg', 'new.jpg');    // Optional name
        $mail->isHTML(true);                                  // Set email format to HTML

        $mail->Subject = '标的投资记录对账';
        $mail->Body    = $body;

        if(!$mail->send()) {
            echo 'Message could not be sent.';
            echo 'Mailer Error: ' . $mail->ErrorInfo;
        } else {
            echo 'Message has been sent';
        }
    }





}