<?php if (!defined('THINK_PATH')) exit();?><!doctype html>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="viewport" content="width=device-width,initial-scale=1.0,minimum-scale=1.0,maximum-scale=1.0">
<link href="<?php echo C('STATIC_ROOT');?>/mobile/css/basic_new.css" rel="stylesheet" type="text/css" />

<title>票票喵</title>
<style>
.paper_agreement P{font-size:20px;}
.paper_connect input{border:0;width:60%;}
.banner_money input{width:10%;border:none;border-bottom:1px solid #3c3c3c;}
.banner_money span{font-size:16px;font-weight:bold;}
.banner_if p{text-indent:2em;}


</style>
</head>

<body>
<section>
	<div class="paper_agreement tc mtop05">
    	<p>票据收益权转让协议</p>
    </div>
    <div class="paper_contract tc">
    	<p>合同编号:<?php echo ($detail["title"]); ?></p>
		<p><?php echo ($rechargeLog["recharge_no"]); ?>号</p>
    </div>
    <div class="paper_out mtop2 mar10 ">
    	<P>出让方（甲方）：**洛亚*******</P>
        <p>法定代表人：李**</p>
        <p>住所地：**********</p>
        <p>联系人：候**</p>
        <p>联系方式：188****1142</p>
    </div>
    <div class="paper_connect mtop2 mar10 mart10">
		<p class="fl">受让方（乙方）：<?php echo ($due_detail["uinfo"]["real_name"]); ?></p>
        
        <div class="clear"></div>
        <p class="fl">（身份证号码）：<?php echo (hide_whole_idcard($due_detail["uinfo"]["card_no"])); ?></p>
        
        <div class="clear"></div>
        <p class="fl">联系电话：<?php echo ($due_detail["uinfo"]["username"]); ?></p>
         
        <div class="clear"></div>
        <p class="mtop2">监管方（丙方）：杭州富谦网络科技有限公司</p> 
        <p>网站：“票票喵理财网”（域名：www.ppmiao.cn）</p>
        <p>法定代表人：程**</p>
        <p>住所地：**********</p>
        <p>联系方式：0571-8695****</p>
        <p class="mtop2">鉴于：</p>	
        <p>1、票票喵理财网（域名：www.ppmiao.cn）由丙方运营管理。甲乙双方均系票票喵理财网的注册会员。</p>
        <p>2、甲方为合法成立并有效存续的公司法人，甲方合法持有的银行承兑汇票（以下称“标的票据”），并合法享有标的票据之票据权利。</p>
        <p>3、乙方代表投资者将资金用于投资甲方持有的标的票据收益权，且由投资者享有收益和自负风险。</p>
        <p>4、甲方拟向乙方转让其持有的标的票据收益权。</p>
        <p>5、乙方委托丙方：对甲方将票据收益权转让给乙方的标的票据进行监管。</p>
        <p class="mtop">根据《中华人民共和国合同法》、《中华人民共和国民法通则》等有关法律规定，甲乙丙三方本着诚实信用的基本原则，经平等友好协商，自愿就甲方通过票票喵理财网平台向乙方转让债权收益权的相关事宜达成如下协议：</p>
        <h3 class="mtop">一、定义</h3>
        <p>1、标的票据：指甲方持有的未到期，拟将票据收益权全部或部分转让给乙方的银行承兑汇票。</p>
        <p>2、标的票据权利：指基于甲方合法持有标的票据，而依据《票据法》的规定所合法享有的权利。</p>
        <p>3、标的票据收益：指甲方实现及转让标的票据权利而产生的现金流以及因标的票据权利产生的任何其他收益（扣除甲方实现及转让标的票据权利所必要支出税费）。</p>
        <p>4、标的票据收益权：指甲方基于标的票据权利而合法享有的获得标的票据收益的权利。</p>
        <p>5、票据收益权转让价款：指本合同第四条项下甲方向乙方转让其持有的标的票据收益权所收取的价款，即乙方为获得标的票据收益权所支付的对价。</p>
        <p>6、元：指人民币元。</p>
        <p>7、工作日:指中国大陆法定公休日和法定节假日以外的日期。</p>
        <h3 class="mtop">二、转让标的</h3>
        <p>1、乙方受让的标的为：甲方合法享有的本合同第一条第4款约定的标的票据收益权。</p>
        <p>2、本条第1款所述标的收益权项下标的票据收益权来源包括但不限于：</p>
        <p>（1）标的票据权利实现付款后所产生的所有现金收入；</p>
        <p>（2）标的票据权利实现转让所产生的现金收入；</p>
        <p>（3）根据《票据法》享有的其他现金收入；</p>
        <p>（4）根据法律、行政法规、规章的规定、司法机关的裁决、政府机关的规定，针对标的票据权利而获得的任何形式的补偿、赔偿；</p>
        <p>（5）因标的票据权利所产生的其他任何形式的收入。</p>
        <p>3、本合同履行期间，甲方出现名称、法定代表人等基本信息变动、公司性质变更或公司重组、分立、合并等情形，除非其余两方书面同意，并不导致免除或变更甲方应承担的本合同项下任何义务。</p>
        <h3 class="mtop">三、转让模式</h3>
        <p>1、本协议项下的转让期限为定期模式，乙方不可随时要求提取、兑付投资及其收益。 </p>
        <p>2、标的票据收益权转让成功后，若甲方申请提前赎回标的票据收益权的，需经丙方同意且甲方必须以现金清偿的方式赎回。同时甲方需支付相应保证金（保证金=融资金额+预期收益）到丙方在第三方支付或银行的账户，以此保障乙方的收益。</p>
        <p>3、乙方在本合同约定的转让期限内不得再次转让该标的票据的收益权。</p>
        <p>4、标的票据承兑日到期后，乙方委托丙方进行票据承兑。</p>
    </div>
    <div class="banner_money mar10 mart10">
    	<h3 class="mtop">四、转让价款、付款方式</h3>
        <p>（一）转让价款</p>	
		<p>1、甲方持有的标的票据票面价值人民币<span><?php echo (number_format($contractprice["price"],2)); ?></span>元，转让价为<span><?php echo (number_format($detail["amount"],2)); ?></span>元。</p>
        <p>2、乙方自愿出资<span><?php echo (number_format($due_detail["due_capital"],2)); ?></span>元，购买甲方标的票据的全部或部分收益权。</p>
        <p>3、预期收益<span><?php echo (number_format($due_detail["due_interest"],2)); ?></span>元（预期利息收益以基础债权合同剩余合同期限<span><?php echo ($due_detail["duration_day"]); ?></span>天为计息天数，按年化<span><?php echo (number_format($detail["user_interest"],2)); ?>%</span>利率计算）。</p>
        <p>4、转让期间为本协议生成之日至<span><?php echo (date('Y年m月d日',strtotime($detail["end_time"]))); ?></span>。</p>        
        <p>（二）付款方式</p>
        <p>1、乙方在丙方平台点击投资，输入购买金额、购买人姓名、身份证号码、联系方式、银行卡信息，点击支付后，视为购买成功。</p>
        <p>2、乙方购买成功后即成为票票喵理财网的注册会员，购买的注册手机号为会员号。</p>
        <p>3、乙方购买标的票据收益权的银行储蓄卡只能绑定一个账户，一个账户对应一个实名认证。</p>
        <h3 class="mtop">五、标的票据收益权的实现</h3>
        <p>1、乙方购买成功后，享有甲方标的票据的全部或部分收益权。</p>
        <p>2、收益从T+1日开始计算（该等T日为“投资收益成交日”）。</p>
        <p>3、三方认可并同意：，按乙方实际购买金额（即本金）计算收益，到期后按一次性还本付息的原则将本金及收益自动打款至乙方的投资账户，打款至银行卡预计需1-3个工作日。</p>
        <h3 class="mtop">六、各方的陈述及保证</h3>
        <p>1、甲方是标的票据的合法持票人，享有完整标的票据权利，甲方与前手之间或与出票人具有合法的交易关系或债权债务关系，标的票据系甲方基于该等关系而从前手处合法取得。甲方确保向乙方转让的全部或部分标的票据的收益权符合法律法规、监管政策及甲方的公司章程,码、邮箱等，并按照平台的规定完成身份认证等。若因乙方自身信息填写有误产生资金损失的，责任由乙方承担。</p>
        <p>2、丙方作为票据监管方，自收到标的票据之日起，安全托管标的票据，并依照乙方授权，对标的票据按期发起托收、并监督标的票据到期足额解付。如因丙方原因导致票据无法正常到期解付，丙方应承担相应过失责任，根据具体情况，与乙方商定赔偿事宜。丙方应密切保持与甲、乙方的联系，如有问题，及时通知甲、乙方。</p>
        <p>3、丙方并不对乙方的投资资金本金和任何收益(包括任何预期收益)承担保证、保本承诺或任何其他责任。</p>
        <p>4、任何一方违反本合同中约定的义务，包括违反陈述和保证，均构成违约，应承担违约责任，负责赔偿因此而造成的相应损失。</p>
        <h3 class="mtop">七、 支付迟延免责</h3>
        <div class="banner_if">
            <p>如因第三方支付机构原因，致使甲方未能在T+2个工作日内收到乙方购买金额的，或乙方未能在转让到期后 3 个工作日内收到本金和收益的，甲、乙双方方可以通过票票喵理财网网络平台查询未到帐的原因或联系丙方客服，丙方保证在收到第三方支付机构的委托投资标的收益后 1 工作日内，将金额支付至甲方或乙方收款账户内。对因第三方支付机构等因支付迟延等原因而造成的提取资金实际兑付日的顺延或迟误，丙方不承担任何责任。</p>
        </div>
        <h3 class="mtop">八、税费承担</h3>
        <p>甲方应承担本合同履行过程中发生的税费。</p>
        <h3 class="mtop">九、通知</h3>
        <p>1、履行本协议有关法律文书应以书面形式做出，如通过票票喵理财网网络平台发布方式传送的，一经发布即为有效送达。</p>
        <p>2、以传真、电子邮件、挂号信及特快专递发出的有关通知的，在书面通知传送至合同方预留在另一方或票票喵理财网的传真、电子邮箱地址、通信地址即为送达。</p>
        <P>3、合同一方变更通讯联系地址，应在变更日更新最新通讯地址于票票喵理财网，否则，应自行承担不能送达的法律后果。</P>
        <h3 class="mtop">十、保密</h3>
        <p>1、本协议签署后, 任何一方只能将保密信息和其内容用于本协议项下的目的, 不得用于任何其他目的。除非事先得到另一方的书面同意,任何一方不得向非本协议方以外披露本协议以及本协议项下的事宜以及有关的任何文件、资料或信息（“保密信息”）；但向本协议一方的合伙人、董事、监事、高级管理人员和雇员及其聘请的会计师、律师、咨询公司披露或因法律、法规的强制性规定而披露及依据其他应遵守的法规向司法、行政机构进行的披露除外。</p>
        <p> 2、甲乙双方同意丙方有权出于为甲乙双方提供服务的目的视情况向其他任何，丙方认为必要的业务合作机构披露本协议、甲乙双方方资料、保密信息等资料和信息。丙方承诺将要求相关合作机构对丙方披露的信息承担保密义务，但是丙方对于相关合作机构违反保密义务的行为不对甲乙双方方承担任何赔偿责任。</p>
        <p>3、甲乙双方未能按相关协议规定履行相关义务时，丙方有权在丙方认为适当的场合披露相应责任方的信息，包括但不限于名称、地址等。</p>
        <p>4、本协议任何一方应采取所有其他必要、适当和可以采取的措施，以确保保密信息的保密性。本协议项下的保密义务在本协议终止后持续有效。</p>
        <h3 class="mtop">十一、合同的变更和补充</h3>
        <p>1、本协议中所使用的定义，除在上下文中另有定义外，以票票喵理财网公布的定义或解释为准。</p>
        <p class="fl">2、丙方在认为必要时，有权对本协议随时进行更改。协议一旦发生任何变更，丙方将在其网站相应 页面公布更改内容，并在公布之日起立即生效。如果您继续使用票票喵理财网的相关服务，则视为接受协议条款的变更；如果您不同意变更后的协议，则必须再更改内容公布后<u>&nbsp;3&nbsp;</u>工作日内提出停止接受服务的要求。</p>
        <p>3、本协议的任何修改、补充均须以票票喵理财网平台电子文本形式作出。</p>
        <h3 class="mtop">十二、合同生效</h3>
        <div class="banner_if">
            <p>本协议采用电子文本形式制成，乙方按照“票票喵理财网”的规则，通过对甲方的票据收益权（“标的债权收益权”）转让需求点击 “投资”按钮，进入投资理财详细信息界面，填写完成乙方的投资理财信息后并在线完成债权收益权转让款支付后本协议即成立并立即生效。承担任何责任。</p>
        </div>
        <h3 class="mtop">十三、争议解决</h3>
        <p>1、本协议未尽事项或与本协议有关的争议，应通过友好协商解决，协商不成，可向丙方所在地有管辖权的人民法院提起诉讼。</p>
        <h3 class="mtop">十四、其他</h3>
        <p>甲乙双方一致同意委托丙方保管所有与本协议有关的书面文件或电子信息。</p>
        <p class="mtop2">甲方：**洛亚******</p>
    </div>
    <div class="banner_write mtop2 mar10 mart10" >
    	<p class="fl">乙方：<?php echo ($due_detail["uinfo"]["real_name"]); ?></p>
        
        <div class="clear"></div>
        <p class="mtop2">丙方：杭州富谦网络科技有限公司</p>
    </div>
    <div class="banner_date mtop2">
    	
        <p class="fr">日期：<?php echo (date('Y年m月d日',strtotime($due_detail["add_time"]))); ?></p>
    </div>
        
</section>
</body>
</html>